{
  "format": "graph-model",
  "generatedBy": "2.4.1",
  "convertedBy": "TensorFlow.js Converter v3.3.0",
  "signature": {
    "inputs": {
      "images:0": {
        "name": "images:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "192" }, { "size": "192" }, { "size": "3" }] }
      }
    },
    "outputs": {
      "module_apply_default/MobilenetV1/Predictions/Softmax:0": {
        "name": "module_apply_default/MobilenetV1/Predictions/Softmax:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "2024" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "images",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": { "dim": [{ "size": "-1" }, { "size": "192" }, { "size": "192" }, { "size": "3" }] }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/hub_input/Mul/y",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "module_apply_default/hub_input/Sub/y",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/Logits/Conv2d_1c_1x1/weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "1024" }, { "size": "2024" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/Logits/Conv2d_1c_1x1/biases",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "2024" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "3" }, { "size": "32" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "32" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "32" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "32" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "32" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "64" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }, { "size": "128" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "512" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "128" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }, { "size": "128" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "128" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "128" }, { "size": "256" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "256" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "512" }, { "size": "1024" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "256" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "256" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "256" }, { "size": "256" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "256" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "1024" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "256" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "256" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "256" }, { "size": "512" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "512" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "512" }, { "size": "512" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "3" }, { "size": "3" }, { "size": "1024" }, { "size": "1" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "512" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "512" }, { "size": "512" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "1024" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "512" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "512" }, { "size": "512" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "1024" }, { "size": "1024" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "512" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "512" }, { "size": "512" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "1024" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "512" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "512" }] } } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "512" }, { "size": "512" }]
              }
            }
          }
        }
      },
      {
        "name": "module_apply_default/hub_input/Mul",
        "op": "Mul",
        "input": ["images", "module_apply_default/hub_input/Mul/y"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "module_apply_default/hub_input/Sub",
        "op": "Sub",
        "input": ["module_apply_default/hub_input/Mul", "module_apply_default/hub_input/Sub/y"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_0/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/hub_input/Sub",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_0/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "explicit_paddings": { "list": {} },
          "use_cudnn_on_gpu": { "b": true },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "epsilon": { "f": 0.0 },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_0/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "num_args": { "i": "1" },
          "padding": { "s": "U0FNRQ==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_1_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_2_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "padding": { "s": "U0FNRQ==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "use_cudnn_on_gpu": { "b": true },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_3_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "U0FNRQ==" },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "use_cudnn_on_gpu": { "b": true },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_4_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "explicit_paddings": { "list": {} },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "epsilon": { "f": 0.0 },
          "use_cudnn_on_gpu": { "b": true },
          "T": { "type": "DT_FLOAT" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_5_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "num_args": { "i": "1" },
          "padding": { "s": "U0FNRQ==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "use_cudnn_on_gpu": { "b": true },
          "explicit_paddings": { "list": {} },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "epsilon": { "f": 0.0 },
          "padding": { "s": "U0FNRQ==" },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_6_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "epsilon": { "f": 0.0 },
          "explicit_paddings": { "list": {} },
          "num_args": { "i": "1" },
          "use_cudnn_on_gpu": { "b": true }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_7_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "padding": { "s": "U0FNRQ==" },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" },
          "use_cudnn_on_gpu": { "b": true },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_8_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" },
          "padding": { "s": "U0FNRQ==" },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_9_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "padding": { "s": "U0FNRQ==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "epsilon": { "f": 0.0 },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "use_cudnn_on_gpu": { "b": true },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_10_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "epsilon": { "f": 0.0 },
          "use_cudnn_on_gpu": { "b": true },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_11_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise",
        "op": "FusedDepthwiseConv2dNative",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_12_pointwise/Relu6",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise_bn_offset"
        ],
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_depthwise/depthwise",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_weights",
          "module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdTY="] } },
          "T": { "type": "DT_FLOAT" },
          "epsilon": { "f": 0.0 },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "use_cudnn_on_gpu": { "b": true },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/Logits/AvgPool_1a/AvgPool",
        "op": "AvgPool",
        "input": ["module_apply_default/MobilenetV1/MobilenetV1/Conv2d_13_pointwise/Relu6"],
        "attr": {
          "ksize": { "list": { "i": ["1", "6", "6", "1"] } },
          "padding": { "s": "VkFMSUQ=" },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "module_apply_default/MobilenetV1/Logits/Conv2d_1c_1x1/BiasAdd",
        "op": "_FusedConv2D",
        "input": [
          "module_apply_default/MobilenetV1/Logits/AvgPool_1a/AvgPool",
          "module_apply_default/MobilenetV1/Logits/Conv2d_1c_1x1/weights",
          "module_apply_default/MobilenetV1/Logits/Conv2d_1c_1x1/biases"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "padding": { "s": "U0FNRQ==" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
